#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_route53_zone.zone: Reading...
data.aws_route53_zone.zone: Read complete after 0s [id=Z0734546290TNA2OB7F9Y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudfront_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloudfront_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::weatherapp-assets-bucket/*",
            ]
          + sid       = "AllowCloudFrontServicePrincipalReadOnly"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::590183664238:distribution/EL7FDHQ9QIUWK",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.website_cdn will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website_cdn" {
        id                             = "EL7FDHQ9QIUWK"
        tags                           = {
            "Created_By" = "Fidaa Mahboob"
        }
      ~ web_acl_id                     = "arn:aws:wafv2:us-east-1:590183664238:global/webacl/weathersense-waf/080ba19b-f38e-46f3-b1cb-5a29e57ff3fa" -> "080ba19b-f38e-46f3-b1cb-5a29e57ff3fa"
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket_policy" {
        id     = "weatherapp-assets-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::590183664238:distribution/EL7FDHQ9QIUWK"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::weatherapp-assets-bucket/*"
                      - Sid       = "AllowCloudFrontServicePrincipalReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl.weathersense_waf will be updated in-place
  ~ resource "aws_wafv2_web_acl" "weathersense_waf" {
        id            = "080ba19b-f38e-46f3-b1cb-5a29e57ff3fa"
        name          = "weathersense-waf"
        tags          = {}
        # (7 unchanged attributes hidden)

      - rule {
          - name     = "AWS-BadInputsRuleSet" -> null
          - priority = 2 -> null

          - action {
              - block {
                }
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "bad-inputs" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWS-BotControlRuleSet" -> null
          - priority = 3 -> null

          - action {
              - block {
                }
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "bot-control" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWS-CommonRuleSet" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "common-rules" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWS-BadInputsRuleSet"
          + priority = 2

          + override_action {
              + count {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "bad-inputs"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-BotControlRuleSet"
          + priority = 3

          + override_action {
              + count {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "bot-control"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-CommonRuleSet"
          + priority = 1

          + override_action {
              + count {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "common-rules"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @fidaa-mahboob, Action: `pull_request`*